[
    {"id":1, "first_name": "John", "last_name": "Smith", "title": "Practical Engineering", "url": "https://images.pexels.com/photos/235986/pexels-photo-235986.jpeg", "content": "Engineering involves a lot of theory. But we don't always get to see it in practice. This series teaches fundamental principles that all civil and mechanical engineers need to know, alongside demonstrations that show how they really work. Using everything from desktop models predicting the movement of groundwater to hand-built examples of mechanically stabilized earth, instructor Grady Hillhouse explains how engineering concepts become real. Every month, he introduces an important new topic that will improve your understanding of essential engineering principles, including force, strength, tension, compression, and more, and help you find better solutions to common design challenges."},
    {"id":2, "first_name": "James", "last_name": "Jones", "title": "Data Engineering Foundations",  "url": "https://images.pexels.com/photos/259915/pexels-photo-259915.jpeg", "content": "Data science can be generally defined as the process of making data useful, and data engineering is a key part of how and why. If you think of data science like a race car, the data engineers are the pit crew. They’re not driving the car, but they make the car much easier to drive. Data engineers make sure the data flow is running smoothly, monitor systems, anticipate problems, and repair the data pipeline whenever problems arise. They extract and gather data from multiple sources and load it into a single, easy-to-query database. In short, data engineers make data scientists’ lives easier. In this course, Harshit Tyagi explains the fundamentals of data engineering. He covers key topics like data wrangling, database schema, and developing ETL pipelines. He also details several data engineering tools like Hive, Hadoop, Spark, and Airflow. By the end of this course, it should be abundantly clear why the data engineer is one of the most valuable people in a data-driven organization."},
    {"id":3, "first_name": "Robert", "last_name": "Jones", "title": "Engineering Drawings for Manufacturing", "url": "https://images.pexels.com/photos/586744/pexels-photo-586744.jpeg", "content": "Preparing clear, complete engineering drawings is a critical skill for nearly every design engineer. New engineers have traditionally had to learn drafting skills on the job, usually by trial and error. This course teaches the practical skills needed to independently prepare clear drawings that satisfy industry standards. For the learner, this course can increase marketability and reduce frustration during the first months of a new career. For the employer, this course can reduce the time required to train new engineers and decrease the potential for costly mistakes due to poor drawings. Join the engineering team from Tarkka for this hands-on look at creating engineering drawings for manufacturing, from preparing your template and selecting the right drawing type to choosing and placing views, specifying dimensions, and setting tolerances. By the end of this course, you'll have the skills to create clear, complete drawings that hold up to the most exacting standards. This course was created by Tarkka. We are pleased to offer this training in our library."},
    {"id":4, "first_name": "Michael", "last_name": "Davis", "title": "MATLAB 2018 Essential Training", "url": "https://images.pexels.com/photos/364096/pexels-photo-364096.jpeg", "content": "Learn how to analyze data using one of the most powerful statistical software packages available: MATLAB 2018. MATLAB is a highly useful tool for complex computation as it allows high-order calculations and analysis in matrices. In fact, it treats all of its data as vectors and matrices, so the course starts with a basic linear algebra tutorial outside of the program before describing essential analytical skills performed using MATLAB. Instructor Curt Frye covers creating MATLAB scripts, accepting user input, extending MATLAB with user-defined functions, controlling flow with conditional logic and loops, managing text strings and other data structures like numbers, performing advanced plotting, and summarizing data using statistical analysis functions. By the end of the course, data scientists such as engineers and economist should be able to effectively use MATLAB for numerical analysis, data modeling, and data visualization."},
    {"id":5, "first_name": "William", "last_name": "Smith", "title": "SOLIDWORKS: Advanced Engineering Drawings", "url": "https://images.pexels.com/photos/1590549/pexels-photo-1590549.jpeg", "content": "If you’re a SOLIDWORKS user looking to take your skills to the next level, join David Antanavige as he shows how to create advanced engineering drawings that can be used in product documentation and manufacturing specifications. David goes way beyond basic views of parts and components and details how to create broken-out section views, alternate position views, and bills of materials. He also shows how to add geometric dimensioning and tolerancing (GD&T) symbols for manufacturing specifications, and finishes the course by showing how to create 2D layouts."},
    {"id":6, "first_name": "David", "last_name": "Martinez", "title": "DevOps Foundations: Site Reliability Engineering", "url": "https://images.pexels.com/photos/1591447/pexels-photo-1591447.jpeg", "content": "Site reliability engineering (SRE) is an emerging paradigm in DevOps. The biggest names in tech—companies like Google, Netflix, Microsoft, and LinkedIn—all use SRE. In fact, industry wide, \"site reliability engineer\" is replacing \"DevOps engineer\" in job posts. Simply put, SRE is software engineering applied to operations—for the cloud native era. This course introduces the basics of site reliability engineering, including how SRE fits into DevOps and how it can be integrated into your unique business environment. Instructors Ernest Mueller and James Wickett cover the major areas of expertise, including release engineering, change management, incident management and retrospectives, self-service automation, troubleshooting, performance, and deliberate adversity. Learn how to define reliability through SLAs and SLOs, handle crisis, design distributed systems, and scale your systems and your team. Plus, explore time and project management strategies that bring humanity back to the SRE's job."},
    {"id":7, "first_name": "Richard", "last_name": "Davis", "title": "Ethical Hacking: Social Engineering", "url": "https://images.pexels.com/photos/719609/pexels-photo-719609.jpeg", "content": "Social engineering is a technique hackers use to manipulate end users and obtain information about an organization or computer systems. In order to protect their networks, IT security professionals need to understand social engineering, who is targeted, and how social engineering attacks are orchestrated. In this course, cybersecurity expert Lisa Bock discusses the methods a hacker might use, including embedding malicious links and attachments in emails and using mobile devices and social media to deploy an attack. She discusses the concept of \"misuse of trust\"—how hackers use charm, power, and influence to penetrate an organization—and why you need to be extra cautious with the disgruntled employee. Finally, Lisa discusses countermeasures security professionals can take to address these attacks."},
    {"id":8, "first_name": "Charles", "last_name": "Davis", "title": "Technical Sales: The Role of the Sales Engineer", "url": "https://images.pexels.com/photos/207353/pexels-photo-207353.jpeg", "content": "Salespeople sell the product. Developers build the product. Sales engineers bridge the gap. Sales engineering, also known as technical sales, is an in-demand and well-paid role. But many people don't know the job even exists. This course introduces the role and responsibilities of the sales engineer, along with the main concepts of technical sales. It is designed for salespeople who want to enter Silicon Valley and the engineers who want a more customer-oriented role. Instructor John Care shows how to uncover business problems, link those problems to your solution, and present it to the customer for consideration. He also provides tips for making an effective sales pitch. Start watching to learn more about this exciting new sales career."},
    {"id":9, "first_name": "Joseph", "last_name": "Jones", "title": "Security Awareness: Social Engineering", "url": "https://images.pexels.com/photos/1039083/pexels-photo-1039083.jpeg", "content": "Social engineering is one of the most dangerous forms of hacking because it preys on human nature. Learn how to defend your organization from social engineering by recognizing and thwarting the most common types of attacks. This course provides security teams and professionals with information on common social engineering techniques and safeguards. Instructor Stephanie Ihezukwu—a security analyst and engineer—describes how phishing, vishing, baiting, and physical activities like tailgating all provide entry to bad actors, and explains how training can be the most effective tool to combat these attacks. She also explains how to create policies and procedures; set up controls around passwords, email, and software updates; and conduct tests to see how effective your defenses truly are."},
    {"id":10, "first_name": "Thomas", "last_name": "Smith", "title": "Getting Started with Technology: Think Like an Engineer", "url": "https://images.pexels.com/photos/712319/pexels-photo-712319.jpeg", "content": "You don't have to be intimidated by tech if you gain a foundational understanding of a few core principles. This course gives you insight on how to think like an engineer so that you can feel empowered to create a program, build a website, or even make a mobile app. Software engineer Kathryn Hodge summarizes and analogizes computer science in a simple and logical way as she explains fundamental processes and tools used in programming. Learn about the factors engineers consider as they plan, the processes they perform when creating solutions, and the way they analyze the effectiveness of their technology. Discover how systematic thinking can be something you leverage whether your next step is in the direction of data science or development."},
    {"id":11, "first_name": "Christopher", "last_name": "Lopez", "title": "Essential tools for data engineering", "url": "https://images.pexels.com/photos/531880/pexels-photo-531880.jpeg", "content": "Data science can be generally defined as the process of making data useful, and data engineering is a key part of how and why. If you think of data science like a race car, the data engineers are the pit crew. They’re not driving the car, but they make the car much easier to drive. Data engineers make sure the data flow is running smoothly, monitor systems, anticipate problems, and repair the data pipeline whenever problems arise. They extract and gather data from multiple sources and load it into a single, easy-to-query database. In short, data engineers make data scientists’ lives easier. In this course, Harshit Tyagi explains the fundamentals of data engineering. He covers key topics like data wrangling, database schema, and developing ETL pipelines. He also details several data engineering tools like Hive, Hadoop, Spark, and Airflow. By the end of this course, it should be abundantly clear why the data engineer is one of the most valuable people in a data-driven organization."},
    {"id":12, "first_name": "Daniel", "last_name": "Jones", "title": "Introduction to AWS for Non-Engineers: 2 Security", "url": "https://images.pexels.com/photos/949587/pexels-photo-949587.jpeg", "content": "As part of any good IT infrastructure, security plays an important part in creating a stable technical environment. In the AWS Certified Cloud Practitioner exam, the Security module makes up a fourth of the exam questions. With cloud computing becoming more relevant to many professionals’ lives, even if tangentially, it's a vital topic to explore. This course, the second in a four-part series designed to help professionals in non-technical roles, provides you with a high-level grasp of the major security services and concepts in AWS. Instructor Hiroko Nishimura—founder of Intro to AWS for Newbies—provides an overview of security in the cloud. She then delves into the different security services available: Identity Access Management (IAM), Shield, Inspector, and more. Note: This course also maps to the second domain of the AWS Certified Cloud Practitioner exam. Taking all four courses in the Introduction to AWS for Non-Engineers series will help you prepare for the exam."},
    {"id":13, "first_name": "Paul", "last_name": "Lopez", "title": "Social engineering overview", "url": "https://images.pexels.com/photos/547114/pexels-photo-547114.jpeg", "content": "Cybersecurity isn't solely within your IT department's purview. If you own a smartphone, work on a computer, or use the internet, then you're exposed to a variety of security risks on a daily basis. In this course, instructor Caroline Wong details what these threats are and what you can do about them—both to protect yourself and your organization. In a series of engaging scenarios, Caroline shines a spotlight on some of the most common security risks you'll encounter in your personal and work life, as well as how to mitigate them. Learn how to identify and avoid phishing, malware, and social engineering attacks. Plus, get best practices for protecting your accounts, company intellectual property, and online activity."},
    {"id":14, "first_name": "Mark", "last_name": "Jones", "title": "Understand search engine basics", "url": "https://images.pexels.com/photos/544268/pexels-photo-544268.jpeg", "content": "Having basic computer skills is a significant asset in today's modern world. Computers keep us connected to family and friends and help us do our jobs. Learn how to use a computer comfortably, while improving learning and productivity. This course focuses on the Microsoft Windows 10 operating system and offers a thorough, jargon-free introduction to computers, files and folders, networks, and peripherals like printers and keyboards. Garrick Chows also covers basic skills for working with software applications, the Internet, and email."},
    {"id":15, "first_name": "Donald", "last_name": "Davis", "title": "Apache Spark Essential Training: Big Data Engineering", "url": "https://images.pexels.com/photos/2254030/pexels-photo-2254030.jpeg", "content": "In order to construct data pipelines and networks that stream, process, and store data, data engineers and data-science DevOps specialists must understand how to combine multiple big data technologies. In this course, discover how to build big data pipelines around Apache Spark. Join Kumaran Ponnambalam as he takes you through how to make Apache Spark work with other big data technologies. He covers the basics of Apache Kafka Connect and how to integrate it with Spark for real-time streaming. In addition, he demonstrates how to use the various technologies to construct an end-to-end project that solves a real-world business problem."}
]